name: "FCN"

layer {
  name: "data"
  type: "Data"
  top: "data"
  include {
    phase: TRAIN
  }
  transform_param {
    mirror: true
    mean_file: "/data/oird_fcn/60label/train_mean.binaryproto"
  }
  data_param {
    source: "/data/oird_fcn/60label/raw_train"
    batch_size: 2
    backend: LMDB
  }
}
layer {
  name: "label"
  type: "Data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    mirror: true
  }
  data_param {
    source: "/data/oird_fcn/60label/groundtruth_train"
    batch_size: 2
    backend: LMDB
  }
}
layer {
  name: "data"
  type: "Data"
  top: "data"
  include {
    phase: TEST
  }
  transform_param {
    mirror: true
    mean_file: "/data/oird_fcn/60label/test_mean.binaryproto"
  }
  data_param {
    source: "/data/oird_fcn/60label/raw_test"
    batch_size: 1
    backend: LMDB
  }
}

layer {
  name: "label"
  type: "Data"
  top: "label"
  include {
    phase: TEST
  }
  data_param {
    source: "/data/oird_fcn/60label/groundtruth_test"
    batch_size: 1
    backend: LMDB
  }
}


layers {
    bottom: "data"
    top: "conv1_1"
    name: "conv1_1"
    type: "Convolution"
    param {
    lr_mult: 1
    decay_mult: 1
    }
  param {
    lr_mult: 2
    decay_mult: 0
    }
  convolution_param {
    engine: CAFFE
    num_output: 64
    pad: 100
    kernel_size: 3
    }
  }
layers {
    bottom: "conv1_1"
    top: "conv1_1"
    name: "relu1_1"
    type: "ReLU"
 }
layers {
    bottom: "conv1_1"
    top: "conv1_2"
    name: "conv1_2"
    type: "Convolution"
     param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
   lr_mult: 2
   decay_mult: 0
  }
    convolution_param {
        engine: CAFFE
        num_output: 64
        pad: 1
        kernel_size: 3
   }
 }
layers {
    bottom: "conv1_2"
    top: "conv1_2"
    name: "relu1_2"
    type: "ReLU"
     }
layers {
    name: "pool1"
    bottom: "conv1_2"
    top: "pool1"
    type: "Pooling"
    pooling_param {
        pool: MAX
        kernel_size: 2
        stride: 2
    }
   }
layers {
    name: "conv2_1"
    bottom: "pool1"
    top: "conv2_1"
    type: "Convolution"
    param {
        lr_mult: 1
        decay_mult: 1
    }
    param {
        lr_mult: 2
        decay_mult: 0
    }
    convolution_param {
    engine: CAFFE
    num_output: 128
    pad: 1
    kernel_size: 3
     }
   }
layers {
    bottom: "conv2_1"
    top: "conv2_1"
    name: "relu2_1"
    type: "ReLU"
 }
layers {
    bottom: "conv2_1"
    top: "conv2_2"
    name: "conv2_2"
    type: "Convolution"
    param {
        lr_mult: 1
        decay_mult: 1
    }
    param {
        lr_mult: 2
        decay_mult: 0
    }
    convolution_param {
        engine: CAFFE
        num_output: 128
        pad: 1
        kernel_size: 3
        }
     }
layers {
    bottom: "conv2_2"
    top: "conv2_2"
    name: "relu2_2"
    type: "ReLU"
 }
layers {
bottom: "conv2_2"
top: "pool2"
name: "pool2"
type: "Pooling"
pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
    }
}
layers {
    bottom: "pool2"
    top: "conv3_1"
    name: "conv3_1"
    type: "Convolution"
    param {
        lr_mult: 1
        decay_mult: 1
    }
    param {
        lr_mult: 2
        decay_mult: 0
    }
    convolution_param {
        engine: CAFFE
        num_output: 256
        pad: 1
        kernel_size: 3
     }
 }
layers {
    bottom: "conv3_1"
    top: "conv3_1"
    name: "relu3_1"
    type: "ReLU"
 }
layers {
    bottom: "conv3_1"
    top: "conv3_2"
    name: "conv3_2"
    type: "Convolution"
    param {
        lr_mult: 1
        decay_mult: 1
    }
    param {
        lr_mult: 2
        decay_mult: 0
    }
    convolution_param {
        engine: CAFFE
        num_output: 256
        pad: 1
        kernel_size: 3
     }
}
layers {
    bottom: "conv3_2"
    top: "conv3_2"
    name: "relu3_2"
    type: "ReLU"
}
layers {
    bottom: "conv3_2"
    top: "conv3_3"
    name: "conv3_3"
    type: "Convolution"
    param {
        lr_mult: 1
        decay_mult: 1
    }
    param {
        lr_mult: 2
        decay_mult: 0
    }
    convolution_param {
        engine: CAFFE
        num_output: 256
        pad: 1
        kernel_size: 3
     }
 }
layers {
    bottom: "conv3_3"
    top: "conv3_3"
    name: "relu3_3"
    type: "ReLU"
}
layers {
    bottom: "conv3_3"
    top: "pool3"
    name: "pool3"
    type: "Pooling"
    pooling_param {
        pool: MAX
        kernel_size: 2
        stride: 2
    }
}
layers {
    bottom: "pool3"
    top: "conv4_1"
    name: "conv4_1"
    type: "Convolution"
    param {
        lr_mult: 1
        decay_mult: 1
    }
    param {
        lr_mult: 2
        decay_mult: 0
    }
    convolution_param {
        engine: CAFFE
        num_output: 512
        pad: 1
        kernel_size: 3
    }
}
layers {
    bottom: "conv4_1"
    top: "conv4_1"
    name: "relu4_1"
    type: "ReLU"
}
layers {
    bottom: "conv4_1"
    top: "conv4_2"
    name: "conv4_2"
    type: "Convolution"
    param {
        lr_mult: 1
        decay_mult: 1
    }
    param {
        lr_mult: 2
        decay_mult: 0
    }
    convolution_param {
        engine: CAFFE
        num_output: 512
        pad: 1
        kernel_size: 3
    }
 }
layers {
    bottom: "conv4_2"
    top: "conv4_2"
    name: "relu4_2"
    type: "ReLU"
}
layers {
    bottom: "conv4_2"
    top: "conv4_3"
    name: "conv4_3"
    type: "Convolution"
    param {
        lr_mult: 1
        decay_mult: 1
    }
    param {
        lr_mult: 2
        decay_mult: 0
    }
    convolution_param {
        engine: CAFFE
        num_output: 512
        pad: 1
        kernel_size: 3
     }
}
layers {
    bottom: "conv4_3"
    top: "conv4_3"
    name: "relu4_3" t
    ype: "ReLU"
}
layers {
    bottom: "conv4_3"
    top: "pool4"
    name: "pool4"
    type: "Pooling"
    pooling_param {
        pool: MAX
        kernel_size: 2
        stride: 2
     }
}
layers {
    bottom: "pool4"
    top: "conv5_1"
    name: "conv5_1"
    type: "Convolution"
    param {
        lr_mult: 1
        decay_mult: 1
    }
    param {
        lr_mult: 2
        decay_mult: 0
    }
    convolution_param {
        engine: CAFFE
        num_output: 512
        pad: 1
        kernel_size: 3
     }
}
layers {
bottom: "conv5_1"
top: "conv5_1"
name: "relu5_1"
type: "ReLU"
}
layers {
    bottom: "conv5_1"
    top: "conv5_2"
    name: "conv5_2"
    type: "Convolution"
    param {
        lr_mult: 1
        decay_mult: 1
    }
    param {
        lr_mult: 2
        decay_mult: 0
    }
    convolution_param {
        engine: CAFFE
        num_output: 512
        pad: 1
        kernel_size: 3
    }
}
layers {
    bottom: "conv5_2"
    top: "conv5_2"
    name: "relu5_2"
    type: "ReLU"
}
layers {
    bottom: "conv5_2"
    top: "conv5_3"
    name: "conv5_3"
    type: "Convolution"
    param {
        lr_mult: 1
        decay_mult: 1
    }
    param {
        lr_mult: 2
        decay_mult: 0
    }
    convolution_param {
        engine: CAFFE
        num_output: 512
        pad: 1
        kernel_size: 3
    }
 }
layers {
    bottom: "conv5_3"
    top: "conv5_3"
    name: "relu5_3"
    type: "ReLU"
 }
layers {
    bottom: "conv5_3"
    top: "pool5"
    name: "pool5"
    type: "Pooling"
    pooling_param {
        pool: MAX
        kernel_size: 2
        stride: 2
     }
}
layers {
    bottom: "pool5"
    top: "fc6"
    name: "fc6"
    type: "Convolution"
    param {
        lr_mult: 1
        decay_mult: 1
    }
    param {
        lr_mult: 2
        decay_mult: 0
    }
    convolution_param {
        engine: CAFFE
        kernel_size: 7
        num_output: 4096
    }
}
layers {
    bottom: "fc6"
    top: "fc6"
    name: "relu6"
    type: "ReLU"
}
layers {
    bottom: "fc6"
    top: "fc6"
    name: "drop6"
    type: "Dropout"
    dropout_param {
        dropout_ratio: 0.5
   }
}
layers {
    bottom: "fc6"
    top: "fc7"
    name: "fc7"
    type: "Convolution"
    param {
        lr_mult: 1
        decay_mult: 1
    }
    param {
        lr_mult: 2
        decay_mult: 0
    }
    convolution_param {
          engine: CAFFE
          kernel_size: 1
          num_output: 4096
      }
  }
layers {
    bottom: "fc7"
    top: "fc7"
    name: "relu7"
    type: "ReLU"
}
layers {
    bottom: "fc7"
    top: "fc7"
    name: "drop7"
    type: "Dropout"
    dropout_param {
        dropout_ratio: 0.5
    }
}
layers {
#
# THIS LAYER IS DIFFERENT
# name is "score-fr" instead of "score59"
# Not just a different name
    name: "score-fr"
    type: "Convolution"
    bottom: "fc7"
#
# In the other prototxt, the `top:' would read: `top: "score-fr"'
#
    top: "score"
    param {
        lr_mult: 1
        decay_mult: 1
    }
    param {
        lr_mult: 2
        decay_mult: 0
    }
    convolution_param {
        engine: CAFFE
        num_output: 21
        kernel_size: 1
     }
}

layers {
    type: "Deconvolution"
#
# This is name: "upsample" here is name: "upscore2" in the other network
#
    name: "upsample"
    bottom: "score"
    top: "bigscore"
    param {
    lr_mult: 1
    decay_mult: 1
    }
    convolution_param {
        num_output: 21
        kernel_size: 64
        stride: 32
    }
}
#
# The other network contains more fusing and upsampling
#
layers { type: CROP name: "crop" bottom: "bigscore" bottom: "data" top: "upscore" }